<a href="https://colab.research.google.com/github/s375301/AI-python-connect/blob/main/1_enumerate%26corr.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

In [4]:
df = pd.read_csv("/content/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [5]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [6]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [7]:
dict(enumerate(sorted(df["race"].unique())))
# enumerate() : indexed list를 만들 때 유용, 반복문에 의해 번호 부여

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [16]:
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
value

[0, 1, 2, 3]

In [9]:
list(enumerate(df["race"].unique()))

[(0, 'white'), (1, 'other'), (2, 'hispanic'), (3, 'black')]

In [21]:
np.array(list(enumerate(df["race"].unique())))
# as 2 dim-matrix

array([['0', 'white'],
       ['1', 'other'],
       ['2', 'hispanic'],
       ['3', 'black']], dtype='<U21')

In [10]:
np.array(list(enumerate(df["race"].unique())))[:, 0]
# dtype : str

array(['0', '1', '2', '3'], dtype='<U21')

In [18]:
list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
# dtype : int

[0, 1, 2, 3]

In [23]:
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()
key

['male', 'female']

In [25]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist())) # value needs to be dtype "int" : solved by map()
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()
value, key

([0, 1], ['male', 'female'])

In [26]:
df["sex"].replace(to_replace=key, value=value, inplace=True) # inplace argument to edit original
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

In [27]:
df.sum(axis=0)

earn                                            4.47434e+07
height                                              91831.2
sex                                                     859
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [28]:
df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80653.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [29]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [30]:
df.isnull().sum(0) # True = 1, 0 stands for axis

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [31]:
df.sort_values(["age", "earn"], ascending=False).head() # desc, elder age then higher income

             earn  height  sex   race  ed  age
3    80478.096153   63.22    1  other  16   95
809  42963.362005   72.94    0  white  12   95
331  39169.750135   64.79    1  white  12   95
102  39751.194030   67.14    0  white  12   93
993  32809.632677   59.61    1  other  16   92

In [32]:
df.age.corr(df.earn) # correlation btw age and income

0.07400349177836055

In [33]:
df.age[(df.age<45) & (df.age>15)].corr(df.earn)

0.3141178872518905

In [34]:
df.age.cov(df.earn)

36523.6992104089

In [35]:
df.corr()

            earn    height       sex        ed       age
earn    1.000000  0.291600 -0.337328  0.350374  0.074003
height  0.291600  1.000000 -0.703672  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000 -0.061747  0.070036
ed      0.350374  0.114047 -0.061747  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.129802  1.000000

In [36]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
ed        0.350374
age       0.074003
dtype: float64

In [37]:
df.sex.value_counts(sort=True)

1    859
0    520
Name: sex, dtype: int64